** Check if the script is running interactively
   #+begin_src bash
     #!/bin/sh
     if [ -t 0 ]; then
         echo script running interactively
     else
         echo stdin coming from a pipe or file
     fi


     if [ -t 1 ] ; then
       echo output going to the screen
     else
       echo output redirected to a file or pipe
     fi
   #+end_src

   #+RESULTS:
   : stdin coming from a pipe or file

